Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E15B.tmx
Source language: en_us
Languages: zh_cn

source: Kale and Quinoa Salad
zh_cn: 甘蓝藜麦沙拉做法

source: I created this speedy, simple dish with Marisa Miller Wolfson in mind.
zh_cn: 我记住了Marisa Miller Wolfson的蔬菜做法，然后我创造这种简单、快速的沙拉做法。

source: It features two -- no, three -- of her vegan faves -- quinoa, kale and nutritional yeast.
zh_cn: 它有两个特色，噢，不，三个Marisa作为素食主义者的最爱，藜麦、橄榄菜、营养酵母。

source: Vegucate yourself -- nutritional yeast is not weird.
zh_cn: 为自己做蔬菜美食，用营养酵母并不奇怪。

source: It provides a big B-12 boost and terrific cheesy flavor sans animal.
zh_cn: 它能够提供大量的B-12，和大量的无动物脂肪的干酪质口味。

source: What's not to love?
zh_cn: 那有什么是不能喜爱它的呢？

source: Tart this dish up with a handful of your favorite chopped herbs, pair it with grilled vegetables or tempeh or serve with a salad.
zh_cn: 先给盘子上用切好的香草增加香味，然后配上烤过的蔬菜和豆豉。

source: 1 cup quinoa, rinsed in and drained
zh_cn: 1杯藜麦，冲洗再去水。

source: 2 cups water or vegetable broth
zh_cn: 2杯水或是蔬菜汤。

source: 1/3 cup pine nuts
zh_cn: 1/3杯松子。

source: 2 tablespoons olive oil
zh_cn: 2大汤匙的橄榄油。

source: 2 cloves garlic, chopped
zh_cn: 2个独头蒜，切开。

source: 1 pinch red pepper flakes
zh_cn: 1掐红辣椒片。

source: 1 big bunch kale (about 3 cups), tough sterms removed, leaves sliced into skinny bite-sized ribbons
zh_cn: 1大串甘蓝（大概3个杯子），把硬头去掉，把剩下来的刨切到一口可以吃掉的带状。

source: 2 tablespoons nutritional yeast
zh_cn: 2大汤匙营养酵母。

source: 1/2 cup white wine
zh_cn: 1/2杯白葡萄酒。

source: sea salt and fresh ground pepper to taste
zh_cn: 海盐和新鲜的胡椒作为调味料。

source: In a medium-sized pot, bring water or vegetable broth to boil.
zh_cn: 选一个适中的锅，把水或蔬菜汤煮沸。

source: Add quinoa. Reduce heat to low and cover. Cook quinoa for about 12 to 15 minutes or until all liquid is absorbed and quinoa is plumped.
zh_cn: 放入藜麦，换到小火并盖上盖子，煮上12到15分钟，直到所有液体都被藜麦吸收并鼓起来，关火，把它放到一边降温。

source: Remove from burner and set aside to cool. Place a large dry skillet over medium-high heat. Add pine nuts. Toast nuts, stirring or give pan a shake every few minutes, until nuts are golden brown and smell luscious and buttery, about 5 minutes.
zh_cn: 换上干燥的煎锅，开中火，放入松子，翻炒，每过一分钟就摇晃摇晃，直到松子变得金黄，闻起来有松子的甘香或是黄油香。这个过程大概5分钟。

source: Pour pine nuts into a small bowl and set aside.
zh_cn: 把松子倒入小碗，放到一边。

source: Pour the olive oil into the skillet and return to heat.
zh_cn: 把橄榄油倒入煎锅，再加热。

source: Add chopped garlic and cook, stirring, until garlic turns soft and golden, about 5 minutes.
zh_cn: 放入切过大蒜开始翻炒，直到大蒜变软、变金黄，这过程大概5分钟。

source: Add kale by the handful and stir until kale is just wilted, 3 to 5 minutes.
zh_cn: 加入甘蓝翻炒，直到它刚刚好变软，大概3到5分钟。

source: Stir in quinoa, nutritional yeast wine and season to taste. Cook another few minutes or until heated through. Add pine nuts and toss to combine.
zh_cn: 把藜麦、营养酵母、白葡萄酒和调味料一起加入进去，大概再炒几分钟直到彻底加热，最后再把炒过的松子倒入合并。
